import React from 'react';

const About = () => {
    return (
        <div className='w-screen home'>
            <div className='w-5/6 ms-auto me-auto mb-20 mt-10'>
                <h1 className="text-4xl text-center lg:text-left md:text-5xl font-bold text-[#054C73] mb-6">О компании</h1>
                <div className='w-full md:w-4/6 ms-auto me-auto'>
                    <p className='text-[20px] font-normal text-black' style={{ letterSpacing: '1.5px' }}>
                        Компания "ТехноФасад" успешно работает на рынке мебельного производства более 10 лет,
                        зарекомендовав себя как надежный поставщик качественных мебельных фасадов, которые радуют клиентов не только
                        внешним видом, но и функциональностью.
                        <br />
                        <br />
                        Мы сотрудничаем с отечественными производителями сырья, что позволяет нам гарантировать стабильное качество и поддерживать высокий стандарт нашей продукции.
                        <br />
                        <br />
                        В нашем современном производственном цехе используется высокоточное оборудование, обеспечивающее идеальную обработку фасадных деталей и профессиональное оклеивание пленкой.
                        <br />
                        <br />
                        Наша команда квалифицированных специалистов внимательно контролирует каждый этап работы — от согласования дизайна, фрезеровки и цветовых решений до окончательной установки фасадов у вас дома.
                        <br />
                        <br />
                        "ТехноФасад" — это опыт, надежность и внимание к деталям, которые делают каждый заказ уникальным и долговечным.
                    </p>

                    <h2 className="text-[32px] font-bold text-[#054C73] mb-3">Что мы предлагаем</h2>
                    <ul className='list-disc pl-6 text-[20px] font-normal text-black' style={{ letterSpacing: '2px' }}>
                        <li>Индивидуальный подход. Вы сами выбираете дизайн, размеры и цвет, чтобы ваши фасады гармонично вписались в интерьер;</li>
                        <li>Высокое качество. Собственное производство и использование высококачественных материалов от проверенных поставщиков обеспечивают надежность и долговечность изделий;</li>
                        <li>Услуги установки. Для частных клиентов мы не только произведем фасады, но и предоставим профессиональную установку;</li>
                        <li>Сотрудничество с бизнесом. Мы предоставляем нашу продукцию компаниям, занимающимся установкой или заменой фасадов у частных лиц.</li>
                    </ul>

                    <h2 className="text-[32px] font-bold text-[#054C73] mb-3">Почему выбирают нас</h2>
                    <ul className='list-disc pl-6 text-[20px] font-normal text-black' style={{ letterSpacing: '2px' }}>
                        <li>Более 10 лет на рынке;</li>
                        <li>100% гарантия на всю продукцию до 18 месяцев;</li>
                        <li>Выполнение заказов по индивидуальному макету, составленному с учетом всех предпочтений заказчика;</li>
                        <li>Доставка и подъем готовой продукции входит в стоимость заказа;</li>
                        <li>Всю работу выполняют профессионалы с многолетним опытом;</li>
                        <li>Возможность выезда специалиста по замерам на ваш объект для составления точного 3D проекта заказа;</li>
                        <li>Возможно оформление кредита или рассрочки.</li>
                    </ul>

                    <h2 className="text-[32px] font-bold text-[#054C73] mb-3">Наша компания включает в себя</h2>
                    <ul className='list-disc pl-6 text-[20px] font-normal text-black' style={{ letterSpacing: '2px' }}>
                        <li>Удобный офис для консультации покупателей</li>
                        <li>Современное производственное оборудование;</li>
                        <li>Надежных поставщиков качественных материалов и фурнитуры;</li>
                        <li>И главное - отзывчивый и квалифицированный персонал.</li>
                    </ul>
                </div>
            </div>
        </div>
    );
};

export default About;
